CivilFilingClient/TestFiles/TEST_CMP2_TESTDAN.XML

<?xml version="1.0"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" 
                  xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" 
                  xmlns:xsd="http://www.w3.org/2001/XMLSchema" 
                  xmlns:tns2="http://webservice.civilfiling.ecourts.ito.aoc.nj/">
  <soapenv:Body>
    <tns2:submitCivilFiling>
      <arg0>
        <bulkFilingPacket>
          <attachmentList>
            <contentType>application/pdf</contentType>
            <docType>pdf</docType>
            <documentCode>CMPL</documentCode>
            <documentDescription>Complaint</documentDescription>
            <documentName>TEST_CMP_TESTDAN</documentName>
            <extention>.pdf</extention>
          </attachmentList>
          <attorneyFirmId>9735384700</attorneyFirmId>
          <attorneyId>288551973</attorneyId>
          <civilCase>
            <caseAction>028</caseAction>
            <courtSection>SCP</courtSection>
            <defendantCaption>\DEFENDANT CAPTION\</defendantCaption>
            <demandAmount>5400.00</demandAmount>
            <docketDetailsForOtherCourt>str</docketDetailsForOtherCourt>
            <juryDemand>N</juryDemand>
            <lawFirmCaseId>TESTDAN</lawFirmCaseId>
            <otherCourtActions>str</otherCourtActions>
            <plaintiffCaption>\PLAINTIFF CAPTION\</plaintiffCaption>
            <serviceMethod>03</serviceMethod>
            <venue>ATL</venue>
            <venueOfIncident>CPM</venueOfIncident>
          </civilCase>
          <defendantList>
            <adaAccommodationInd>N</adaAccommodationInd>
            <corporationName>XYZ Corp</corporationName>
            <corporationType>CO</corporationType>
            <interpreterInd>N</interpreterInd>
            <partyAffiliation></partyAffiliation>
            <partyDescription>BUS</partyDescription>
          </defendantList>
          <fee>
            <accountNumber>141375</accountNumber>
            <attorneyClientRefNumber>TESTDAN</attorneyClientRefNumber>
            <attorneyFee>0.00</attorneyFee>
            <feeExempt>Y</feeExempt>
            <paymentType>CG</paymentType>
          </fee>
          <plaintiffList>
            <adaAccommodationInd>N</adaAccommodationInd>
            <address>
              <addressLine1>123 Main street</addressLine1>
              <city>Parsippany</city>
              <stateCode>NJ</stateCode>
              <zipCode>07054</zipCode>
            </address>
            <corporationName>TEST CREDITOR</corporationName>
            <corporationType>CO</corporationType>
            <interpreterInd>N</interpreterInd>
            <partyAffiliation>ADM</partyAffiliation>
            <partyDescription>BUS</partyDescription>
          </plaintiffList>
        </bulkFilingPacket>
      </arg0>
    </tns2:submitCivilFiling>
  </soapenv:Body>
</soapenv:Envelope>